In [21]:
import pandas as pd
import numpy as np

import sqlite3

In [34]:
df = pd.read_csv('data/roles.csv')

df.head()

   id  film_id  person_id      role
0   1        1       1630  director
1   2        1       4843     actor
2   3        1       5050     actor
3   4        1       8175     actor
4   5        2       3000  director

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19791 entries, 0 to 19790
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         19791 non-null  int64
 1   film_id    19791 non-null  int64
 2   person_id  19791 non-null  int64
 3   role       19791 non-null  object
dtypes: int64(3), object(1)
memory usage: 618.6+ KB

In [37]:
df = df.sort_values('id')

In [38]:
df.columns

Index(['id', 'film_id', 'person_id', 'role'], dtype='object')

In [39]:
df.drop('id', axis=1, inplace=True)

In [46]:
con = sqlite3.connect("movies.db")

In [47]:
df.head()

   film_id  person_id      role
0        1       1630  director
1        1       4843     actor
2        1       5050     actor
3        1       8175     actor
4        2       3000  director

In [48]:
df.to_sql('roles', con, if_exists='replace', index=False)

19791

In [45]:
con.close()